# 1

a = 200
b = 800

M_X = (a + b) / 2 # 500
D_X = (b - a)**2 / 12 # 30000

# 2
a = 0.5
D_X = 0.2

b = a + (12 * D_X) ** 0.5 # 2.05
M_X = (a + b) / 2 # 1.27

# 3

M_X =  -2
D_X = 16
std = 4

# 4

mu = 174
sig = 8

def Z(x):
    return (x - mu) / sig

# a

print(Z(182)) # 1
# sig = 8 см.

P = 0.15866

# б. От 2sig

P = 0.0228

# в. От -sig до +2sig

P = 0.9772 - 0.1587 # 0.8185

# г. От -sig До +sig

P = 0.68

# д. От -2sig До +2sig

P = 0.954

# е. До -3sig или от +2sig. Воспользуемся правилом 3 sig

P = (1 - 0.9972) / 2 + (1 - 0.954)/2 # 0.0244

# ё. До -3sig или от +3sig

P = 0.0028

# ж. До -sig

P = 0.1587

# 5

X = 190
M_X = 178
D_X = 25
sig = D_X ** 0.5

Z = (X - M_X)/ sig # 2.4 sig
print(Z)
